## import

In [2]:
import numpy as np

## Pandas - 관계형 또는 레이블이 된 데이터

In [3]:
import pandas as pd
pd

In [3]:
pd.__version__

'2.3.3'

### Pandas의 Series - 1차원 배열

In [4]:
arr = np.arange(100, 105)
arr

array([100, 101, 102, 103, 104])

In [ ]:
app = np.arange(50, 55) #추가
app

array([50, 51, 52, 53, 54])

In [5]:
s = pd.Series(arr) #arr 자리에 (['부장', '차장', '대리', '사원', '인턴']), list('abcde')와 같이 리스트 넣을 수 있음.
s

0    100
1    101
2    102
3    103
4    104
dtype: int64

In [6]:
s = pd.Series(arr, dtype = 'int32') #dtype 지정하여 생성할 수 있음.
s

0    100
1    101
2    102
3    103
4    104
dtype: int32

### indexing

In [7]:
s.index #0부터, 4까지 step 1로 생성됨. 기본적으로 정해지는 index = RangeIndex 라고 함.

RangeIndex(start=0, stop=5, step=1)

In [8]:
s[0]

np.int32(100)

### fancy indexing

In [9]:
s = pd.Series(['부장', '차장', '대리', '사원', '인턴'])
s[[1,3]] #대괄호 2개, index = [1,3]을 넣는 격

1    차장
3    사원
dtype: object

### boolean indexing - 조건식 만들어서 특정 조건에 대해 True에 해당하는 값만 필터링

In [10]:
s = pd.Series(np.random.randint(1000,20000, size = 10))
s

0     3378
1     2240
2     2902
3     5925
4    13461
5     2720
6     7018
7     6202
8    19643
9    14643
dtype: int32

In [11]:
s>15000

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7    False
8     True
9    False
dtype: bool

In [12]:
s[s>15000]

8    19643
dtype: int32

In [13]:
idx = (s>15000) & (s<18000)
s[idx]

Series([], dtype: int32)

### 사용자 정의의 index

In [14]:
s = pd.Series(['마케팅', '경영', '개발', '기획', '인사'], index = ['a', 'b', 'c', 'd', 'e'])
s

a    마케팅
b     경영
c     개발
d     기획
e     인사
dtype: object

In [15]:
s.index = list('가나다라마')
s

가    마케팅
나     경영
다     개발
라     기획
마     인사
dtype: object

### NaN (Not a Number)

In [16]:
s = pd.Series(['선화', '강호', np.nan, '소정', '우영'])
s

0     선화
1     강호
2    NaN
3     소정
4     우영
dtype: object

In [17]:
s.isnull() #isna랑 같음

0    False
1    False
2     True
3    False
4    False
dtype: bool

In [18]:
s.notnull() #notna랑 같음

0     True
1     True
2    False
3     True
4     True
dtype: bool

In [19]:
s[s.isna()]

2    NaN
dtype: object

### 슬라이싱

In [20]:
s = pd.Series(np.arange(100,150,10))
s

0    100
1    110
2    120
3    130
4    140
dtype: int64

In [21]:
s[1:3]

1    110
2    120
dtype: int64

### Pandas의 DataFrame - 2차원 데이터 구조

In [22]:
pd.DataFrame([[1,2,3,], 
             [4,5,6],
             [7,8,9]], columns = ['가', '나', '다'])

   가  나  다
0  1  2  3
1  4  5  6
2  7  8  9

In [23]:
data  = {'name' : ['Kime', 'Lee', 'Park'], 
         'age' : [24,27,34], 
         'children' : [2,1,3]
}
df = pd.DataFrame(data)
df

   name  age  children
0  Kime   24         2
1   Lee   27         1
2  Park   34         3

### 속성

In [24]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [25]:
df.index = list('abc')
df

   name  age  children
a  Kime   24         2
b   Lee   27         1
c  Park   34         3

In [26]:
df.columns

Index(['name', 'age', 'children'], dtype='object')

In [27]:
df.values

array([['Kime', 24, 2],
       ['Lee', 27, 1],
       ['Park', 34, 3]], dtype=object)

In [28]:
df.dtypes

name        object
age          int64
children     int64
dtype: object

In [29]:
df.T

             a    b     c
name      Kime  Lee  Park
age         24   27    34
children     2    1     3

In [30]:
df['name']

a    Kime
b     Lee
c    Park
Name: name, dtype: object

In [31]:
df[['name', 'children']]

   name  children
a  Kime         2
b   Lee         1
c  Park         3

In [32]:
df = df.rename(columns = {'name': 'ID'})
df

     ID  age  children
a  Kime   24         2
b   Lee   27         1
c  Park   34         3